## Ans1.

read_csv(): reads a CSV file and returns a pandas DataFrame object.
to_csv(): This function is used to write a pandas DataFrame to a CSV file.
groupby(): groups a pandas DataFrame by one or more columns.
merge(): merges two pandas DataFrames on a specified column or index.
pivot_table(): creates a spreadsheet-style pivot table as a pandas DataFrame.

## Ans2

In [5]:
import pandas as pd
def reindex_df(df):
    new_index = range(1,2*len(df)+1 ,2)
    df.index = new_index
    return df

In [6]:
df = pd.DataFrame({'A' : [1,2,3], 'B' : [4,5,6] , 'C': [7,8,9]})
new_df = reindex_df(df)
new_df

   A  B  C
1  1  4  7
3  2  5  8
5  3  6  9

## Ans3

In [23]:
df = pd.DataFrame({'Values' :[10,20,30,40,50]})

In [24]:

def t_sum(df):
    sum_max = 0
    for i in range(3):
        sum_max = sum_max + df['Values'][i]    
    return sum_max

In [25]:
t_sum(df)

60

## Ans4

In [29]:
df = pd.DataFrame({'Text' : ['Word1', 'Sentence 1', '3rd place word']})
df

             Text
0           Word1
1      Sentence 1
2  3rd place word

In [36]:
df['Word_count'] = df['Text'].apply(lambda x: len(str(x).split(' ')))
df

             Text  Word_count
0           Word1           1
1      Sentence 1           2
2  3rd place word           3

## Ans5

DataFrame.size() and DataFrame.shape() are different methods in pandas DataFrame.

DataFrame.size() returns the number of elements in a DataFrame, which is equal to the number of rows multiplied by the number of columns. It returns a single integer value.

DataFrame.shape() returns a tuple that contains the number of rows and columns in a DataFrame. It returns two integer values, representing the number of rows and columns respectively.

For example, if we have a pandas DataFrame df with 5 rows and 3 columns, df.size() would return 15, and df.shape() would return (5, 3).

## Ans6

read_excel()  function is used to read excel files.

## Ans7

In [37]:
df = pd.DataFrame({'Email' : ['yash@example.com', 'ineuron@example.com', 'pwskilss@example.com']})
df

                  Email
0      yash@example.com
1   ineuron@example.com
2  pwskilss@example.com

In [39]:
df['username'] = df['Email'].apply(lambda x: str(x).split('@')[0])
df

                  Email  username
0      yash@example.com      yash
1   ineuron@example.com   ineuron
2  pwskilss@example.com  pwskilss

## Ans8

In [54]:
df = pd.DataFrame({'A' : [3,8,6,2,9], 'B' : [5,2,9,3,1], 'C' : [1,7,4,5,2]})
df

   A  B  C
0  3  5  1
1  8  2  7
2  6  9  4
3  2  3  5
4  9  1  2

In [55]:
df[(df['A'] >5) & (df['B'] < 10)]

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2

## Ans9

In [80]:
df = pd.DataFrame({'Values' : [3,4,6,32,76,47,98]})
df

   Values
0       3
1       4
2       6
3      32
4      76
5      47
6      98

In [81]:
def values(df):
    median = df.median()
    mean = df.mean()
    std_dev = df.std()
    print(f'median ={median}, mean ={mean}, standard deviation ={std_dev}')

In [82]:
values(df)

median =Values    32.0
dtype: float64, mean =Values    38.0
dtype: float64, standard deviation =Values    37.784477
dtype: float64

## Ans10

In [1]:
import pandas as pd

def add_moving_average(df):
    df['MovingAverage'] = df['Sales'].rolling(window=7, min_periods=1).mean()    
    return df

df = pd.DataFrame({'Sales': [10, 20, 30, 40, 50, 60, 70, 80, 90, 100],
                   'Date': pd.date_range('2023-01-01', periods=10)})
df_with_ma = add_moving_average(df)
print(df_with_ma)

   Sales       Date  MovingAverage
0     10 2023-01-01           10.0
1     20 2023-01-02           15.0
2     30 2023-01-03           20.0
3     40 2023-01-04           25.0
4     50 2023-01-05           30.0
5     60 2023-01-06           35.0
6     70 2023-01-07           40.0
7     80 2023-01-08           50.0
8     90 2023-01-09           60.0
9    100 2023-01-10           70.0

## Ans11

In [87]:
from datetime import datetime
dates = pd.date_range(start = '2023-01-01' , end = '2023-01-05')
df = pd.DataFrame({'Date' : dates})
df

        Date
0 2023-01-01
1 2023-01-02
2 2023-01-03
3 2023-01-04
4 2023-01-05

In [89]:
df['Day'] = df['Date'].dt.day_name()
df

        Date        Day
0 2023-01-01     Sunday
1 2023-01-02     Monday
2 2023-01-03    Tuesday
3 2023-01-04  Wednesday
4 2023-01-05   Thursday

## Ans12.

In [2]:
import pandas as pd

def select_date_range(df):
    start_date = pd.Timestamp('2023-01-01')
    end_date = pd.Timestamp('2023-01-31') 
    mask = (df['Date'] >= start_date) & (df['Date'] <= end_date)
    selected_rows = df.loc[mask]
    return selected_rows

df = pd.DataFrame({'Date': pd.date_range('2023-01-01', periods=360)})
selected_df = select_date_range(df)
print(selected_df)

         Date
0  2023-01-01
1  2023-01-02
2  2023-01-03
3  2023-01-04
4  2023-01-05
5  2023-01-06
6  2023-01-07
7  2023-01-08
8  2023-01-09
9  2023-01-10
10 2023-01-11
11 2023-01-12
12 2023-01-13
13 2023-01-14
14 2023-01-15
15 2023-01-16
16 2023-01-17
17 2023-01-18
18 2023-01-19
19 2023-01-20
20 2023-01-21
21 2023-01-22
22 2023-01-23
23 2023-01-24
24 2023-01-25
25 2023-01-26
26 2023-01-27
27 2023-01-28
28 2023-01-29
29 2023-01-30
30 2023-01-31

## Ans13.

The first and foremost necessary library that needs to be imported to use the basic functions of Pandas is pandas itself. The standard convention is to import Pandas with the alias pd as follows:

import pandas as pd